#страница 18
def print_two(*args):
    arg1, arg2 = args
    print(f"arg1: {arg1}, arg2: {arg2}")


def print_two_again(arg1, arg2):
    print(f"arg1: {arg1}, arg2: {arg2}")


def print_one(arg1):
    print(f"arg1: {arg1}")


def print_none():
    print("Ая ничего не принимаю.")


print_two("Михаил", "Райтман")
print_two_again("Михаил","Райтман")
print_one("Первый")
print_none()

#=====Обьявление Функции======
#1. Обьявляем функцию с помощью def
#2. Не может начинаться с цифры \ Латинские буквы и цифры \ Знак подчеркивания \ неможет быть спец символов
#3. после имени идет отрывающая скобка ()
#4. Далее указываем аргументы
#5. Имена аргументов должны быть уникальными
#6 Далее идет закрытие функции ):
#7 Внутри код начинаетс с табуляции или 4 пробелов
#8. ПРоверить что табуляция кончилась если закончился код функции

#====== Обьявление функции =====
#1. Укащываем имя функции
#2. Указываем символ ( после начала имени
#3. Указываем имена аргументов в функции так же как и обьявили
#4. Закрываем функцию )

#Выполнить - вызвать - использовать функцию - это одно и тоже

#Вводим и разбираем код.
