#36 страница в книге - комментарий
# удостовериться что понимаю как работает октоторп
# Прочитать код и нужно понять что я должен ввести

#Комментарии позволяют разобраться в предназначении кода.
#строки после символа # игнорируются python.

print("Это моя программа.") # и этот комментарий игнорируется.

# С помощью комментариев можно "отключать" части кода:
#print("Код не работает.")

print("Код работает.")

#почему код стоит читать обратно? так легче отлавливать не точности и воспринимать код
