#страница41
print("Я подсчитаю свою живность:")
#тут мы делим и потом складываем
print("Куры", 25 + 30 / 6)
#делаем умножение , потом получаем остаток и вычитаем (%деление по модулю)
print("Петухи", 100 - 25 * 3 % 4)

print("А теперь подсчитаю яйца:")
#делаем деление, потом получаем остаток и слева направо делаем сложение и вычитание
print(3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6)
#простой вывод на экран
print("Верно ли, что 3 + 2 < 5 - 7?")
# выполняем операции слева и справа в неравенстве и потом сравниваем
#интересно что тут он вернул False , показал что равенство не верное.
print(3 + 2 < 5 - 7)
#сложение и вывод на экран
print("Сколько будет 3 + 2?", 3 + 2)
#вычитание и вывод на экран
print("А сколько будет 5 - 7?", 5 - 7)
#просто вывод на экран
print("Ой, я, кажется, запутался... Почему False?")
#простой вывод на экран
print("Еще раз посчитаю...")
#сравнение и вывод на экран
print("Это ,больше?" ,5 > -2)
#сравнение и вывод на экран
#применение операторов сравнения - вывод на экран True
print("А это больше или равно?", 5 >= -2)
#сравнение и вывод на экран
#применение операторв сравнения - вывод на экран False
print("А это меньше или равно?", 5 <= -2)

#забавно рассказывают
#Смотрите(Скобки)
#Эти(Экспоненты)
#Умельцы(Умножение)
#Делают(Деление)
#Скачущий(Сложение)
#Велосипед(Вычитание)
