#страница 52 Еще о выводе
#вывод на экран сообщения
print("У Мери был маленький барашек.")
#вывод на экран сообщения через формат
print("Его шерсть была белой как {}.".format('снег'))
#Вывод на экран сообщения
print("И всюду, куда Мэри Шла,")
#Вывод на экран сообщения через умножение
print("Маленький барашек всегда следовал за ней.")
print("." * 10) # что это могло бы значить?

#Записываем в переменнные (8 штук) = Бадди Гай
end1 = "Б"
end2 = "а"
end3 = "д"
end4 = "д"
end5 = "и"
end6 = "Г"
end7 = "а"
end8 = "й"

#Обратите внимание на запятую в конце строки. Уберите ее. Что произошло?
#если убрать запятую что получится ошибка
#Выводим на экран через склеивание переменных и в конце через служебное слово end вместо перевода строки заменяем на пробел
print(end1 + end2 + end3 + end4 + end5, end=' ')
#вывод в одну строчку т.к нет перевода строки
print(end6 + end7 + end8)

#частая ошибка это не внимательность , когда перепечатывал текс то пропустил строку 9
# что нужно сделать - нужно читать в обратном порятке код в слух, тогда будет более понятно.
# В слух вообще хорошая практика читать

#Второй важный момент оставлять комментарии после каждой строки. Это очень важно т.к помогают вникнуть в код более хорошо

#старться больше не совершать таких ошибок

#помнить что ошибки совершают все. даже програмисты =)
