#упражнение 9 Вывод,вывод,вывод
#Несколько непривычный код - набирите его в точности.
#Заводим переменную с днями недели
days = "Пн Вт Ср Чт Пт Сб Вс"
#Заводим переменную месяцы с переводом на новую строку с каждым месяцем
months = "Янв\nФевр\nМарт\nАпр\nМай\nИюнь\nИюль\nАвг"

#Выводим текст из переменной дни
print("Это дни недели: ", days ,)
#Выводим тест из переменной месяцы
print("А это месяцы: ", months ,)

#Выводим свободный комментарий через через кавычки
print("""
Что же тут твориться?
Используются три двойные кавычки.
Мы можем набрать текста сколько угодно.
Даже 4 строки, 5 или 6
""")

#1 проверил
#2 подписал комментарием каждую строку
#3 Ошибок не было - не пропускал строки =)
#4 Сломатть код
